HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/App/App_Motor_Project.c
#include "App_Motor_Project.h"
#include "hc32_ll.h"
#include <string.h>
#include <stdlib.h>
#include <stdint.h>
#include "rtt_log.h"
#include "dev_rturn.h"          // 旋转限位设备
#include "App_Params.h"         // 全局参数 g_AppParam 和 Modbus 寄存器
#include "App_RunAngle.h"

SystemSim_t g_sim = {
    .sim_pwr_pos = 0,
    .sim_pwr_neg = 0,
    .sim_hall_up = 0,
    .sim_hall_down = 0,
    .sim_io_fwd = 0,
    .sim_io_rev = 0,
    .sim_io_speed = 85.0f,
    .sim_adc_val = 1500,
    .sim_motor_speed = 0,
    .sim_motor_dir = 0
};

SystemStatus_t g_status = {
    .motor_status = 0,
    .power_status = 0,
    .hall_status = 0,
    .io_status = 0,
    .current_duty = 0.0f
};

// 旋转限位设备全局指针
RTurn_Device_t* g_rturn_dev = NULL;

// ========== 静态设备实例 ==========
static PWM_Device_t g_pwm_dev;
static MotorDevice_t g_motor_dev;
// Keil Watch 中可直接观察电机仲裁器内部状态
MotorDevice_t* volatile g_pMotorDevWatch = NULL;
static Power_Device_t* g_pwr_pos_dev = NULL;
static Power_Device_t* g_pwr_neg_dev = NULL;
static IO_Device_t* g_io_fwd_dev = NULL;
static IO_Device_t* g_io_rev_dev = NULL;
static Hall_Device_t* g_hall_up_dev = NULL;
static Hall_Device_t* g_hall_down_dev = NULL;
static Voltage_Device_t* g_voltage_bus_dev = NULL;
static Sensor_Device_t* g_sensor_current_dev = NULL;
static MotorHall_Device_t* g_motor_hall_dev = NULL;

ADC_Device_t* g_adc_current_dev = NULL;
ADC_Device_t* g_adc_voltage_dev = NULL;

// ========== 内部函数声明 ==========
static void RegisterAllDevices(void);
static void SetupEventBusSubscriptions(void);
static void UpdateStatusIndicators(void);
static void ProcessDeviceUpdates(void);
static void SetDeviceUpdateIntervals(void);

// ========== 注册所有设备 ==========

static void RegisterAllDevices(void) {
    // // 1. 注册 PWM 设备（已由 main.c 直接初始化）
    // PWM_Config_t pwmConfig = {
    //     .tmr = NULL,  // 暂不配置，由外部初始化
    //     .periphClk = 0,
    //     .channel = 0,
    //     .port = 0,
    //     .pin = 0,
    //     .pinFunc = 0,
    //     .countMode = 0,
    //     .countDir = 0,
    //     .defaultFreqHz = 20000,
    //     .defaultDutyPercent = 0,
    //     .activePolarity = PWM_ACTIVE_HIGH
    // };

    // memcpy(&g_pwm_dev.config, &pwmConfig, sizeof(PWM_Config_t));

    // DeviceOps_t pwm_ops = {
    //     .init = PWM_Device_Init,
    //     .deinit = PWM_Device_Deinit,
    //     .read = PWM_Device_Read,
    //     .write = PWM_Device_Write,
    //     .control = PWM_Device_Control,
    //     .update = PWM_Device_Update
    // };
    // DeviceManager_Register(ID_PWM_MOTOR, "PWM_Motor", DEVICE_TYPE_PWM, &g_pwm_dev, pwm_ops);

    // 2. 注册正电源设备
    Power_Config_t pwrPosCfg = {
        .port = GPIO_PORT_C,
        .pin = GPIO_PIN_13,
        .active_level = 1,
        .power_id = 0,
        .debounce_ms = 20,
        .window_size = 5,
        .sample_interval = 5
    };
    g_pwr_pos_dev = Power_Device_Create(&pwrPosCfg);
    DeviceManager_Register(ID_PWR_POS, "PowerPositive", DEVICE_TYPE_POWER,
                           g_pwr_pos_dev, g_power_ops);

    // // 3. 注册负电源设备（暂未使用 PB2）
    // Power_Config_t pwrNegCfg = {
    //     .port = GPIO_PORT_C,
    //     .pin = GPIO_PIN_14,
    //     .active_level = 1,
    //     .power_id = 1,
    //     .debounce_ms = 20,
    //     .window_size = 5,
    //     .sample_interval = 5
    // };
    // g_pwr_neg_dev = Power_Device_Create(&pwrNegCfg);
    // DeviceManager_Register(ID_PWR_NEG, "PowerNegative", DEVICE_TYPE_POWER,
    //                        g_pwr_neg_dev, g_power_ops);

    // 4. 注册霍尔限位设备（已废弃，使用旋转限位替代）

    // Hall_Config_t upCfg = {
    //     .port = GPIO_PORT_B,
    //     .pin = GPIO_PIN_02,
    //     .active_level = 0,           // 低电平触发（取决于硬件设计 - 常闭型）
    //     .bind_dir = DIR_FWD,
    //     .is_soft_limit = 0,
    //     .debounce_ms = 20,
    //     .window_size = 3,
    //     .sample_interval = 2,
    //     .hall_id = 0
    // };
    // g_hall_up_dev = Hall_Device_Create(&upCfg);
    // DeviceManager_Register(ID_HALL_UP, "LimitUp", DEVICE_TYPE_HALL,
    //                     g_hall_up_dev, g_hall_ops);

    // // 5. 注册下限位开关 (PC14)
    // Hall_Config_t downCfg = {
    //     .port = GPIO_PORT_B,
    //     .pin = GPIO_PIN_10,
    //     .active_level = 0,           // 低电平触发（取决于硬件设计 - 常闭型）
    //     .bind_dir = DIR_REV,
    //     .is_soft_limit = 0,
    //     .debounce_ms = 20,
    //     .window_size = 3,
    //     .sample_interval = 2,
    //     .hall_id = 1
    // };
    // g_hall_down_dev = Hall_Device_Create(&downCfg);
    // DeviceManager_Register(ID_HALL_DOWN, "LimitDown", DEVICE_TYPE_HALL,
    //                     g_hall_down_dev, g_hall_ops);

    // // 6. 注册正转IO设备
    // IO_Config_t ioFwdCfg = {
    //     .port = GPIO_PORT_B,
    //     .pin = GPIO_PIN_13,
    //     .active_level = 1,
    //     .debounce_ms = 20,
    //     .window_size = 3,
    //     .sample_interval = 2,
    //     .io_id = 0
    // };
    // g_io_fwd_dev = IO_Device_Create(&ioFwdCfg);
    // DeviceManager_Register(ID_IO_FWD, "IO_Forward", DEVICE_TYPE_IO,
    //                        g_io_fwd_dev, g_io_ops);

    // // 7. 注册反转IO设备
    // IO_Config_t ioRevCfg = {
    //     .port = GPIO_PORT_B,
    //     .pin = GPIO_PIN_12,
    //     .active_level = 1,
    //     .debounce_ms = 20,
    //     .window_size = 3,
    //     .sample_interval = 2,
    //     .io_id = 1
    // };
    // g_io_rev_dev = IO_Device_Create(&ioRevCfg);
    // DeviceManager_Register(ID_IO_REV, "IO_Reverse", DEVICE_TYPE_IO,
    //                        g_io_rev_dev, g_io_ops);

    // 8. 注册电机仲裁设备
    DeviceOps_t motor_ops = {
        .init = Motor_Init,
        .deinit = Motor_Deinit,
        .read = Motor_Read,
        .write = Motor_Write,
        .control = Motor_Control,
        .update = Motor_Update
    };
    DeviceManager_Register(ID_MOTOR, "MotorArbitrator", DEVICE_TYPE_MOTOR,
                           &g_motor_dev, motor_ops);
    // Keil Watch 中设置全局指针以便观察
    g_pMotorDevWatch = &g_motor_dev;

    // 注册电机霍尔设备
    motor_hall_config_t motorHallCfg = {
        .hall_a_port = PIN_HALL_A_PORT,
        .hall_a_pin = PIN_HALL_A_PIN,
        .hall_b_port = PIN_HALL_B_PORT,
        .hall_b_pin = PIN_HALL_B_PIN,
        .eirq_ch_a = HALL_EIRQ_CH_A,
        .eirq_ch_b = HALL_EIRQ_CH_B,
        .irqn_a = HALL_IRQN_A,
        .irqn_b = HALL_IRQN_B,
        .irq_src_a = HALL_IRQ_SRC_A,
        .irq_src_b = HALL_IRQ_SRC_B,
        .irq_priority = 2,
        .pole_pairs = (uint8_t)g_AppParam.motor_hall_pole_pairs,  // 从Flash读取
        .hall_count = 2,
        .custom_pulses_per_rev = 0
    };

