HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/App/App_Motor_Project.c
    MotorHall_DeviceConfig_t motorHallDevCfg = {
        .motor_id = 0,
        .update_interval_ms = 1
    };

    g_motor_hall_dev = MotorHall_Device_Create(&motorHallCfg, &motorHallDevCfg);

    MAIN_D("Before Register: motor_hall_dev=0x%p\r\n", g_motor_hall_dev);
    MAIN_D("Before Register: motor_hall_dev->config.hall_a_pin=0x%04X\r\n", g_motor_hall_dev->config.hall_a_pin);

    DeviceManager_Register(ID_MOTOR_HALL, "MotorHall", DEVICE_TYPE_HALL,
                        g_motor_hall_dev, g_motor_hall_ops);

    // 验证注册是否成功
    DeviceNode_t* check_node = DeviceManager_Get(ID_MOTOR_HALL);
    if (check_node && check_node->private_data) {
        MotorHall_Device_t* check_dev = (MotorHall_Device_t*)check_node->private_data;
        MAIN_D("After Register: check_dev=0x%p\r\n", check_dev);
        MAIN_D("After Register: check_dev->config.hall_a_pin=0x%04X\r\n", check_dev->config.hall_a_pin);
    }

    // ============================================================
    // ADC 设备注册
    // 注意 ADC 硬件初始化在 dev_adc.c 的 ADC_AdpLayerInit() 中完成
    // 这里只注册设备，ADC 转换由定时器触发或软件触发
    // ============================================================

    // 电流检测 ADC (PA5, CH5) - 电流传感器
    ADC_Config_t adcCurrentCfg = {
        .u8AdcId = 0,                       // 对应 ADC_AdpLayerInit 中的索引
        .u8Channel = 5,                     // ADC_CH5 = PA5
        .u8Port = GPIO_PORT_A,
        .u16Pin = GPIO_PIN_05,
        .enAcqMode = ADC_ACQ_MODE_INTERRUPT, // 中断模式
        .u16DmaBufferSize = 0,              // 不使用DMA
        .u8DmaChannel = 0                   // 不使用DMA
    };

    ADC_Device_t* adc_current_dev = ADC_Device_Create(&adcCurrentCfg);
    g_adc_current_dev = adc_current_dev;
    DeviceManager_Register(ID_ADC_CURRENT, "ADC_Current", DEVICE_TYPE_ADC,
                        adc_current_dev, g_adc_ops);

    // 电压检测 ADC
    //   HB_chuchai 板使用 PA04, CH4
    //   整合板 HandB 使用 PA06, CH6
    //   根据主板的 BOARD_VERSION 自动选择 PA04+CH4 或 PA06+CH6
    ADC_Config_t adcVoltageCfg = {
        .u8AdcId = 1,                       // 对应 ADC_AdpLayerInit 中的索引
        .u8Channel = PIN_ADC_VOLTAGE_CH,                     // ADC_CH6 = PA06 (整合板); HB_chuchai: CH4 = PA04
        .u8Port = PIN_ADC_VOLTAGE_PORT,
        .u16Pin = PIN_ADC_VOLTAGE_PIN,              // PA06 (整合板); HB_chuchai: GPIO_PIN_04
        .enAcqMode = ADC_ACQ_MODE_INTERRUPT, // 中断模式
        .u16DmaBufferSize = 0,              // 不使用DMA
        .u8DmaChannel = 0                   // 不使用DMA
    };

    ADC_Device_t* adc_voltage_dev = ADC_Device_Create(&adcVoltageCfg);
    g_adc_voltage_dev = adc_voltage_dev;
    DeviceManager_Register(ID_ADC_VOLTAGE, "ADC_Voltage", DEVICE_TYPE_ADC,
                        adc_voltage_dev, g_adc_ops);

    // 创建电压母线设备（基于 ADC_VOLTAGE 计算）
    // 从 Flash 参数 g_AppParam 中读取阈值
    {
        // 从 Flash 读取参数，单位 0.1V -> mV
        uint32_t u32OvervoltageThresholdMv = (uint32_t)g_AppParam.voltage_upper_limit * 100UL;
        uint32_t u32UndervoltageThresholdMv = (uint32_t)g_AppParam.voltage_lower_limit * 100UL;
        uint32_t u32OvervoltageHysteresisMv = (uint32_t)g_AppParam.voltage_upper_hysteresis * 100UL;
        uint32_t u32UndervoltageHysteresisMv = (uint32_t)g_AppParam.voltage_lower_hysteresis * 100UL;
        uint8_t u8OvervoltageTriggerCount = g_AppParam.overvoltage_trigger_count;
        uint8_t u8UndervoltageTriggerCount = g_AppParam.undervoltage_trigger_count;

        // 从 Flash 读取的值可能为 0，使用默认值补充
        if (u32OvervoltageThresholdMv == 0) {
            u32OvervoltageThresholdMv = PARAM_DEFAULT_VOLTAGE_UPPER_LIMIT * 100UL;
            PARAMS_DBG("[VOLTAGE] Overvoltage threshold is 0, using default: %lu mV", u32OvervoltageThresholdMv);
        }
        if (u32UndervoltageThresholdMv == 0) {
            u32UndervoltageThresholdMv = PARAM_DEFAULT_VOLTAGE_LOWER_LIMIT * 100UL;
            PARAMS_DBG("[VOLTAGE] Undervoltage threshold is 0, using default: %lu mV", u32UndervoltageThresholdMv);
        }
        if (u32OvervoltageHysteresisMv == 0) {
            u32OvervoltageHysteresisMv = PARAM_DEFAULT_VOLTAGE_UPPER_HYSTERESIS * 100UL;
        }
        if (u32UndervoltageHysteresisMv == 0) {
            u32UndervoltageHysteresisMv = PARAM_DEFAULT_VOLTAGE_LOWER_HYSTERESIS * 100UL;
        }
        if (u8OvervoltageTriggerCount == 0) {
            u8OvervoltageTriggerCount = PARAM_DEFAULT_OVERVOLTAGE_TRIGGER_CNT;
        }
        if (u8UndervoltageTriggerCount == 0) {
            u8UndervoltageTriggerCount = PARAM_DEFAULT_UNDERVOLTAGE_TRIGGER_CNT;
        }

        MAIN_D("[APP] Voltage config from Flash: upper=%lu mV (0.1V=%d), lower=%lu mV (0.1V=%d), "
            "upper_hys=%lu mV, lower_hys=%lu mV, ov_cnt=%d, uv_cnt=%d",
            u32OvervoltageThresholdMv, g_AppParam.voltage_upper_limit,
            u32UndervoltageThresholdMv, g_AppParam.voltage_lower_limit,
            u32OvervoltageHysteresisMv, u32UndervoltageHysteresisMv,
            u8OvervoltageTriggerCount, u8UndervoltageTriggerCount);

        Voltage_Config_t voltageBusCfg = {
            .u8AdcDevId = ID_ADC_VOLTAGE,

            // 过压配置
            .u32OvervoltageThresholdMv = u32OvervoltageThresholdMv,
            .u32OvervoltageHysteresisMv = u32OvervoltageHysteresisMv,
            .u8OvervoltageTriggerCount = u8OvervoltageTriggerCount,

            // 欠压配置
            .u32UndervoltageThresholdMv = u32UndervoltageThresholdMv,
            .u32UndervoltageHysteresisMv = u32UndervoltageHysteresisMv,
            .u8UndervoltageTriggerCount = u8UndervoltageTriggerCount,
        };
        g_voltage_bus_dev = Voltage_Device_Create(&voltageBusCfg);
        DeviceManager_Register(ID_VOLTAGE_BUS, "VoltageBus", DEVICE_TYPE_SENSOR,
                            g_voltage_bus_dev, g_voltage_ops);
    }

    // 创建电流传感器设备
    // 从 Modbus 寄存器读取阈值参数
    {
        int32_t s32ThresholdMa = (int32_t)g_AppParam.current_upper_limit;
        uint32_t u32TriggerMs = (uint32_t)g_AppParam.current_detect_ms;
        uint32_t u32ReleaseMs = (uint32_t)g_AppParam.current_release_ms;
        int32_t s32HysteresisMa = (int32_t)g_AppParam.current_hysteresis_ma;
        uint8_t u8TriggerCount = g_AppParam.overcurrent_trigger_count;

        // 从 Flash 读取的值可能为 0，使用默认值补充
        // 注意 int32_t 类型 -1 表示未初始化，g_AppParam 默认值在 Param_Init 中设置
        if (s32ThresholdMa < 0) {
            s32ThresholdMa = PARAM_DEFAULT_CURRENT_UPPER_LIMIT;
            PARAMS_DBG("[CURRENT] Threshold is invalid (%ld), using default: %ld mA",
                       (long)s32ThresholdMa, (long)PARAM_DEFAULT_CURRENT_UPPER_LIMIT);
        }
        if (u32TriggerMs == 0) {
            u32TriggerMs = PARAM_DEFAULT_CURRENT_DETECT_MS;
        }
        if (u32ReleaseMs == 0) {
            u32ReleaseMs = PARAM_DEFAULT_CURRENT_RELEASE_MS;
        }
        if (s32HysteresisMa == 0) {
            s32HysteresisMa = PARAM_DEFAULT_CURRENT_HYSTERESIS_MA;
        }
        if (u8TriggerCount == 0) {
            u8TriggerCount = PARAM_DEFAULT_OVERCURRENT_TRIGGER_CNT;
        }

        MAIN_D("[APP] Sensor config from Flash: threshold=%ldmA, trigger_window=%ldms, release_window=%ldms, hysteresis=%ldmA, trigger_cnt=%d",
            (long)s32ThresholdMa, (long)u32TriggerMs, (long)u32ReleaseMs, (long)s32HysteresisMa, (int)u8TriggerCount);

