HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/App/App_Motor_Project.c
        Sensor_Config_t sensorCurrentCfg = {
            .u8AdcDevId = ID_ADC_CURRENT,

            .s32OvercurrentThresholdMa = s32ThresholdMa,
            .s32OvercurrentHysteresisMa = s32HysteresisMa,

            .u8OvercurrentMode = OVERCURRENT_MODE_TIME_WINDOW,  // 使用时间窗口模式

            // 计数模式参数（时间窗口模式不使用）
            .u16TriggerWindowSize = 0,
            .u16ReleaseWindowSize = 0,

            // 时间窗口模式参数
            .u32TriggerWindowMs = u32TriggerMs,
            .u32ReleaseWindowMs = u32ReleaseMs,
        };
        g_sensor_current_dev = Sensor_Device_Create(&sensorCurrentCfg);
        DeviceManager_Register(ID_SENSOR_CURRENT, "SensorCurrent", DEVICE_TYPE_SENSOR,
                            g_sensor_current_dev, g_sensor_ops);
    }

    // 注册旋转限位设备
    RTurn_Config_t rturnCfg = {
        .u8MotorHallDevId = ID_MOTOR_HALL,                      // 霍尔脉冲输入
        .u8MotorArbiterDevId = ID_MOTOR,                        // 电机仲裁器（获取期望方向）
        .u8SensorDevId = ID_SENSOR_CURRENT,                     // 电流传感器（过流检测）
        .fReductionRatio = (float)g_AppParam.rturn_reduction_ratio / 10.0f,  // 从 Flash 读取减速比
        .fMaxAngle = (float)g_AppParam.open_limit_angle / 10.0f,                           // 开窗极限
        .fMinAngle = (float)g_AppParam.close_limit_angle / 10.0f,                           // 关窗极限
        .u8ReverseOutput = RTURN_REVERSE_OUTPUT,                // 是否反转输出
        .u8DeviceId = ID_RTURN,
        .u16UpdateIntervalMs = RTURN_UPDATE_INTERVAL_MS         // 更新间隔
    };

    g_rturn_dev = RTurn_Device_Create(&rturnCfg);
    DeviceManager_Register(ID_RTURN, "RTurn", DEVICE_TYPE_SENSOR,
                        g_rturn_dev, g_rturn_ops);
}

// ========== EventBus 订阅设置 ==========
static void SetupEventBusSubscriptions(void) {
    // 按优先级注册（优先级 0 最高，数值越大优先级越低）
    EventBus_Subscribe(TOPIC_POWER, Motor_OnPowerEvent, 0);
    EventBus_Subscribe(TOPIC_LIMIT_HARD, Motor_OnHardLimit, 0);
    EventBus_Subscribe(TOPIC_LIMIT_SOFT, Motor_OnHardLimit, 0);
    EventBus_Subscribe(TOPIC_MANUAL_IO, Motor_OnManualIO, 0);
    EventBus_Subscribe(TOPIC_MOTOR_SPEED_FEEDBACK, Motor_OnSpeedFeedback, 0);
    // 通用过流事件（已废弃，使用定向过流）
    EventBus_Subscribe(TOPIC_ALARM, Motor_OnOvercurrent, 0);
    EventBus_Subscribe(TOPIC_VOLTAGE_ALARM, Motor_OnVoltageAlarm, 0);
    // 电流告警由旋转限位处理
    EventBus_Subscribe(TOPIC_CURRENT_ALARM, RTurn_OnCurrentAlarm, 1);
    // EventBus_Subscribe(TOPIC_CURRENT_ALARM, Motor_OnCurrentAlarm, 1);  // 已禁用: 开窗过流由 RTurn 锁定, 关窗过流由 RTurn 校准/报故障

    // 旋转限位事件由电机仲裁器处理
    EventBus_Subscribe(TOPIC_RTURN_LIMIT, Motor_OnRTurnLimit, 0);
    // 正转(开窗)过流 + 反转(关窗)过流: 双向封锁电机
    EventBus_Subscribe(TOPIC_OVERCURRENT_FWD, Motor_OnOvercurrentFwd, 0);
    EventBus_Subscribe(TOPIC_OVERCURRENT_REV, Motor_OnOvercurrentRev, 0);
    // RS485 手动控制通过 Modbus REG_CTRL_CMD 触发
    EventBus_Subscribe(TOPIC_MANUAL_RS485, Motor_OnManualIO, 0);
}

// ========== 设置设备更新间隔 ==========
static void SetDeviceUpdateIntervals(void) {
    DeviceManager_SetUpdateInterval(ID_PWR_POS, 1);
    DeviceManager_SetUpdateInterval(ID_PWR_NEG, 1);
    // 限位开关已禁用（改用旋转限位）
    // DeviceManager_SetUpdateInterval(ID_HALL_UP, 1);    // 上限位
    // DeviceManager_SetUpdateInterval(ID_HALL_DOWN, 1);  // 下限位
    // DeviceManager_SetUpdateInterval(ID_IO_FWD, 1000);
    // DeviceManager_SetUpdateInterval(ID_IO_REV, 1000);
    // DeviceManager_SetUpdateInterval(ID_PWM_MOTOR, 10000);
    DeviceManager_SetUpdateInterval(ID_MOTOR, 1);
    DeviceManager_SetUpdateInterval(ID_MOTOR_HALL, 1);  // 1ms

    DeviceManager_SetUpdateInterval(ID_ADC_CURRENT, 1);   // ADC 快速采样
    DeviceManager_SetUpdateInterval(ID_ADC_VOLTAGE, 1);   // ADC 快速采样

    // 传感器设备使用较慢的更新间隔 - 10ms 足够
    DeviceManager_SetUpdateInterval(ID_VOLTAGE_BUS, 10);   // 10ms 检测一次电压
    DeviceManager_SetUpdateInterval(ID_SENSOR_CURRENT, 1); // 10ms 检测一次电流
    DeviceManager_SetUpdateInterval(ID_RTURN, 1);          // 1ms 更新一次角度
}

// ========== 模拟模式处理函数 ==========
#if ENABLE_SIMULATION_MODE

void Sim_ProcessInput(void) {
    static uint32_t last_update = 0;
    uint32_t now = tickTimer_GetCount();

    if (now - last_update < 100) return;
    last_update = now;
}

void Sim_PublishEvents(void) {
    uint32_t now = tickTimer_GetCount();
    (void)now;  // 避免编译警告

    // 电源事件
    static uint8_t last_pwr_pos = 0;
    static uint8_t last_pwr_neg = 0;

    if (g_sim.sim_pwr_pos != last_pwr_pos) {
        MotorPowerEvent_t pwrEvent = {.power_id = 0, .is_on = (g_sim.sim_pwr_pos != 0)};
        EventBus_Publish(TOPIC_POWER, &pwrEvent);
        MAIN_D("[SIM] POWER_POS changed: %d -> %d\r\n", last_pwr_pos, g_sim.sim_pwr_pos);
        last_pwr_pos = g_sim.sim_pwr_pos;
    }

    if (g_sim.sim_pwr_neg != last_pwr_neg) {
        MotorPowerEvent_t pwrEvent = {.power_id = 1, .is_on = (g_sim.sim_pwr_neg != 0)};
        EventBus_Publish(TOPIC_POWER, &pwrEvent);
        MAIN_D("[SIM] POWER_NEG changed: %d -> %d\r\n", last_pwr_neg, g_sim.sim_pwr_neg);
        last_pwr_neg = g_sim.sim_pwr_neg;
    }

    // 限位事件
    static uint8_t last_hall_up = 0;
    static uint8_t last_hall_down = 0;

    if (g_sim.sim_hall_up != last_hall_up) {
        MotorLimitEvent_t limitEvent = {.dir = DIR_FWD, .is_active = (g_sim.sim_hall_up != 0)};
        EventBus_Publish(TOPIC_LIMIT_HARD, &limitEvent);
        MAIN_D("[SIM] HALL_UP changed: %d -> %d\r\n", last_hall_up, g_sim.sim_hall_up);
        last_hall_up = g_sim.sim_hall_up;
    }

    if (g_sim.sim_hall_down != last_hall_down) {
        MotorLimitEvent_t limitEvent = {.dir = DIR_REV, .is_active = (g_sim.sim_hall_down != 0)};
        EventBus_Publish(TOPIC_LIMIT_HARD, &limitEvent);
        MAIN_D("[SIM] HALL_DOWN changed: %d -> %d\r\n", last_hall_down, g_sim.sim_hall_down);
        last_hall_down = g_sim.sim_hall_down;
    }

    // IO 事件 - 使用边沿触发
    static uint8_t last_io_fwd = 0;
    static uint8_t last_io_rev = 0;

    // 正转IO事件
    if (g_sim.sim_io_fwd != last_io_fwd) {
        MAIN_D("[SIM] IO_FWD changed: %d -> %d\r\n", last_io_fwd, g_sim.sim_io_fwd);

        MotorManualIOEvent_t ioEvent;
        memset(&ioEvent, 0, sizeof(MotorManualIOEvent_t));  // 清空结构体

        if (g_sim.sim_io_fwd) {
            ioEvent.dir = DIR_FWD;
            ioEvent.type = CMD_TYPE_RUN_FWD;
            ioEvent.speed = g_sim.sim_io_speed;
        } else {
            ioEvent.dir = DIR_FWD;
            ioEvent.type = CMD_TYPE_STOP;
            ioEvent.speed = 0.0f;
        }

        // 打印调试信息
        int32_t speed_int = (int32_t)(ioEvent.speed * 10);
        MAIN_D("[SIM] Publishing IO_FWD event: dir=%d, type=%d, speed=%ld.%ld%%\r\n",
               ioEvent.dir, ioEvent.type, (long)(speed_int / 10), (long)(speed_int % 10));

        EventBus_Publish(TOPIC_MANUAL_IO, &ioEvent);
        last_io_fwd = g_sim.sim_io_fwd;
    }

    // 反转IO事件
    if (g_sim.sim_io_rev != last_io_rev) {
        MAIN_D("[SIM] IO_REV changed: %d -> %d\r\n", last_io_rev, g_sim.sim_io_rev);

        MotorManualIOEvent_t ioEvent;
        memset(&ioEvent, 0, sizeof(MotorManualIOEvent_t));  // 清空结构体

