HCHCHC99/HB_chuchai_v2.0.0/project/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/App/App_Motor_Project.c
        if (g_sim.sim_io_rev) {
            ioEvent.dir = DIR_REV;
            ioEvent.type = CMD_TYPE_RUN_REV;
            ioEvent.speed = g_sim.sim_io_speed;
        } else {
            ioEvent.dir = DIR_REV;
            ioEvent.type = CMD_TYPE_STOP;
            ioEvent.speed = 0.0f;
        }

        // 打印调试信息
        int32_t speed_int = (int32_t)(ioEvent.speed * 10);
        MAIN_D("[SIM] Publishing IO_REV event: dir=%d, type=%d, speed=%ld.%ld%%\r\n",
               ioEvent.dir, ioEvent.type, (long)(speed_int / 10), (long)(speed_int % 10));

        EventBus_Publish(TOPIC_MANUAL_IO, &ioEvent);
        last_io_rev = g_sim.sim_io_rev;
    }
}

#endif

// ========== 更新状态指示器 ==========

static void UpdateStatusIndicators(void) {
    static uint32_t last_update = 0;
    uint32_t now = tickTimer_GetCount();

    if (now - last_update < 50) return;
    last_update = now;

    // 从电机仲裁器读取状态
    const MotorDebugInfo_t* dbg = Motor_GetDebugInfo(&g_motor_dev);
    if (dbg) {
        if (dbg->state == MS_IDLE) {
            g_status.motor_status = MOTOR_STOPPED;
        } else if (dbg->active_dir == DIR_FWD) {
            g_status.motor_status = MOTOR_FORWARD;
        } else if (dbg->active_dir == DIR_REV) {
            g_status.motor_status = MOTOR_REVERSE;
        }
        g_status.current_duty = dbg->current_duty;
    }

    // 电源状态（模拟模式）
    if (g_sim.sim_pwr_pos && g_sim.sim_pwr_neg) {
        g_status.power_status = POWER_BOTH_ON;
    } else if (g_sim.sim_pwr_pos) {
        g_status.power_status = POWER_POS_ON;
    } else if (g_sim.sim_pwr_neg) {
        g_status.power_status = POWER_NEG_ON;
    } else {
        g_status.power_status = POWER_BOTH_OFF;
    }

    // 限位状态（模拟模式）
    if (g_sim.sim_hall_up && g_sim.sim_hall_down) {
        g_status.hall_status = HALL_BOTH_LIMIT;
    } else if (g_sim.sim_hall_up) {
        g_status.hall_status = HALL_UP_LIMIT;
    } else if (g_sim.sim_hall_down) {
        g_status.hall_status = HALL_DOWN_LIMIT;
    } else {
        g_status.hall_status = HALL_NO_LIMIT;
    }

    g_status.io_status = (g_sim.sim_io_fwd ? 1 : (g_sim.sim_io_rev ? 2 : 0));
}

static void ProcessDeviceUpdates(void) {
    DeviceManager_UpdateAll();
}

// ========== 系统初始化函数 ==========
void ESystem_Init(void) {
    // 1. 先初始化 EventBus
    EventBus_Init();

    // 2. 初始化 DeviceManager，并关联 EventBus
    DeviceManagerConfig_t config = {
        .operation_timeout_ms = 500,
        .enable_mutex = 1,
        .auto_subscribe = 0
    };
    DeviceManager_Init(&config);

    // 3. 注册所有设备
    RegisterAllDevices();

    // 4. 设置 EventBus 订阅（必须在设备注册之后）
    SetupEventBusSubscriptions();

    // 6. 先初始化电机仲裁器
    //  因为其他设备可能依赖仲裁器状态
    MAIN_D("[APP] Initializing motor arbiter first...\r\n");
    Device_Init(ID_MOTOR);

    // 再初始化其他所有设备
    MAIN_D("[APP] Initializing remaining devices...\r\n");
    for (uint8_t i = 0; i < MAX_DEVICES; i++) {
        if (i == ID_MOTOR) continue;  // 已初始化
        Device_Init(i);
    }

    // 6. 设置各设备的更新间隔
    SetDeviceUpdateIntervals();

    // 7. 启用所有设备的自动更新
    DeviceManager_EnableAllUpdate();

    // 8. 初始化绝对角度模块（在 param_manager 就绪后）
    RunAngle_Init();

    memset(&g_status, 0, sizeof(SystemStatus_t));
}

// ========== 主循环函数 ==========
// ========== 配置重载函数 ==========
/**
 * @brief    当 g_AppParam 被 Modbus 修改后，重新加载配置到各设备
 *        通常在 Modbus 写操作完成后调用
 */
void App_ReloadConfig(void)
{
    MAIN_D("[RELOAD] Reloading config from g_AppParam...\r\n");

    /* --- 电压设备：重载阈值和参数 --- */
    if (g_voltage_bus_dev != NULL)
    {
        g_voltage_bus_dev->stcConfig.u32OvervoltageThresholdMv =
            (uint32_t)g_AppParam.voltage_upper_limit * 100UL;
        g_voltage_bus_dev->stcConfig.u32UndervoltageThresholdMv =
            (uint32_t)g_AppParam.voltage_lower_limit * 100UL;
        g_voltage_bus_dev->stcConfig.u32OvervoltageHysteresisMv =
            (uint32_t)g_AppParam.voltage_upper_hysteresis * 100UL;
        g_voltage_bus_dev->stcConfig.u32UndervoltageHysteresisMv =
            (uint32_t)g_AppParam.voltage_lower_hysteresis * 100UL;
        g_voltage_bus_dev->stcConfig.u8OvervoltageTriggerCount =
            g_AppParam.overvoltage_trigger_count;
        g_voltage_bus_dev->stcConfig.u8UndervoltageTriggerCount =
            g_AppParam.undervoltage_trigger_count;

        MAIN_D("[RELOAD] Voltage: over=%lu mV, under=%lu mV\r\n",
               g_voltage_bus_dev->stcConfig.u32OvervoltageThresholdMv,
               g_voltage_bus_dev->stcConfig.u32UndervoltageThresholdMv);
    }

    /* --- 电流传感器：重载阈值和参数 --- */
    if (g_sensor_current_dev != NULL)
    {
        g_sensor_current_dev->stcConfig.s32OvercurrentThresholdMa =
            (int32_t)g_AppParam.current_upper_limit;
        g_sensor_current_dev->stcConfig.u32TriggerWindowMs =
            (uint32_t)g_AppParam.current_detect_ms;
        g_sensor_current_dev->stcConfig.u32ReleaseWindowMs =
            (uint32_t)g_AppParam.current_release_ms;
        g_sensor_current_dev->stcConfig.s32OvercurrentHysteresisMa =
            (int32_t)g_AppParam.current_hysteresis_ma;

        MAIN_D("[RELOAD] Current: threshold=%ld mA, trigger=%lu ms, release=%lu ms\r\n",
               (long)g_sensor_current_dev->stcConfig.s32OvercurrentThresholdMa,
               (unsigned long)g_sensor_current_dev->stcConfig.u32TriggerWindowMs,
               (unsigned long)g_sensor_current_dev->stcConfig.u32ReleaseWindowMs);
    }

    /* 设备地址 (node_id) 由 Flash 存储，在 Param_Init 时已加载 */

    /* --- 旋转限位：重载减速比和角度范围 --- */
    if (g_rturn_dev != NULL)
    {
        g_rturn_dev->stcConfig.fReductionRatio =
            (float)g_AppParam.rturn_reduction_ratio / 10.0f;
        g_rturn_dev->stcConfig.fMaxAngle =
            (float)g_AppParam.open_limit_angle / 10.0f;
        g_rturn_dev->stcConfig.fMinAngle =
            (float)g_AppParam.close_limit_angle / 10.0f;
        MAIN_D("[RELOAD] Reduction ratio: %.1f, MaxAngle: %.1f, MinAngle: %.1f\r\n",
               (double)g_rturn_dev->stcConfig.fReductionRatio,
               (double)g_rturn_dev->stcConfig.fMaxAngle,
               (double)g_rturn_dev->stcConfig.fMinAngle);
    }

    /* --- 电机霍尔：重载极对数 --- */
    if (g_motor_hall_dev != NULL && g_motor_hall_dev->handle != NULL)
    {
        motor_hall_set_pole_pairs(g_motor_hall_dev->handle,
                                  (uint8_t)g_AppParam.motor_hall_pole_pairs);
        g_motor_hall_dev->config.pole_pairs =
            (uint8_t)g_AppParam.motor_hall_pole_pairs;
        MAIN_D("[RELOAD] Pole pairs: %d\r\n",
               (int)g_AppParam.motor_hall_pole_pairs);
    }

    MAIN_D("[RELOAD] Config reload complete.\r\n");
}

void ESystem_MainLoop(void) {
    static uint32_t last_loop_time = 0;
    uint32_t now = tickTimer_GetCount();

    if (now - last_loop_time < 1) return;
    last_loop_time = now;
    /* 过流事件处理（方案二）：ISR 置标志 → 主循环顶部立即发布，先于 RS485/Modbus */
    Sensor_Device_ProcessPendingEvent();

#if ENABLE_SIMULATION_MODE
    Sim_ProcessInput();
    Sim_PublishEvents();
#endif

    ProcessDeviceUpdates();
    RunAngle_Update();         /* 根据霍尔脉冲增量跟踪绝对角度 */
    UpdateStatusIndicators();
}